packages/superoffice-python-sdk/superoffice_python_sdk-0.2.8-py2-none-any.whl/superofficesdk/partner.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions name="PartnerSystemUserService" targetNamespace="http://www.superoffice.com/superid/partnersystemuser/0.1" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="http://www.superoffice.com/superid/partnersystemuser/0.1" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">
  <wsp:Policy wsu:Id="BasicHttpBinding_IPartnerSystemUserService1_policy">
    <wsp:ExactlyOne>
      <wsp:All>
        <sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <wsp:Policy>
            <sp:TransportToken>
              <wsp:Policy>
                <sp:HttpsToken RequireClientCertificate="false"/>
              </wsp:Policy>
            </sp:TransportToken>
            <sp:AlgorithmSuite>
              <wsp:Policy>
                <sp:Basic256/>
              </wsp:Policy>
            </sp:AlgorithmSuite>
            <sp:Layout>
              <wsp:Policy>
                <sp:Strict/>
              </wsp:Policy>
            </sp:Layout>
          </wsp:Policy>
        </sp:TransportBinding>
      </wsp:All>
    </wsp:ExactlyOne>
  </wsp:Policy>
  <wsdl:types>
    <xs:schema elementFormDefault="qualified" targetNamespace="http://www.superoffice.com/superid/partnersystemuser/0.1" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:element name="AuthenticationRequest">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="SignedSystemToken" nillable="true" type="xs:string"/>
            <xs:element minOccurs="0" name="ReturnTokenType" type="tns:TokenType"/>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:simpleType name="TokenType">
        <xs:restriction base="xs:string">
          <xs:enumeration value="Jwt"/>
          <xs:enumeration value="Saml"/>
        </xs:restriction>
      </xs:simpleType>
      <xs:element name="TokenType" nillable="true" type="tns:TokenType"/>
      <xs:element name="ApplicationToken" nillable="true" type="xs:string"/>
      <xs:element name="ContextIdentifier" nillable="true" type="xs:string"/>
      <xs:element name="AuthenticationResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="IsSuccessful" type="xs:boolean"/>
            <xs:element minOccurs="0" name="Token" nillable="true" type="xs:string"/>
            <xs:element minOccurs="0" name="ErrorMessage" nillable="true" type="xs:string"/>
          </xs:sequence>
        </xs:complexType>
      </xs:element>
    </xs:schema>
    <xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/">
      <xs:element name="anyType" nillable="true" type="xs:anyType"/>
      <xs:element name="anyURI" nillable="true" type="xs:anyURI"/>
      <xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/>
      <xs:element name="boolean" nillable="true" type="xs:boolean"/>
      <xs:element name="byte" nillable="true" type="xs:byte"/>
      <xs:element name="dateTime" nillable="true" type="xs:dateTime"/>
      <xs:element name="decimal" nillable="true" type="xs:decimal"/>
      <xs:element name="double" nillable="true" type="xs:double"/>
      <xs:element name="float" nillable="true" type="xs:float"/>
      <xs:element name="int" nillable="true" type="xs:int"/>
      <xs:element name="long" nillable="true" type="xs:long"/>
      <xs:element name="QName" nillable="true" type="xs:QName"/>
      <xs:element name="short" nillable="true" type="xs:short"/>
      <xs:element name="string" nillable="true" type="xs:string"/>
      <xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/>
      <xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/>
      <xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/>
      <xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/>
      <xs:element name="char" nillable="true" type="tns:char"/>
      <xs:simpleType name="char">
        <xs:restriction base="xs:int"/>
      </xs:simpleType>
      <xs:element name="duration" nillable="true" type="tns:duration"/>
      <xs:simpleType name="duration">
        <xs:restriction base="xs:duration">
          <xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/>
          <xs:minInclusive value="-P10675199DT2H48M5.4775808S"/>
          <xs:maxInclusive value="P10675199DT2H48M5.4775807S"/>
        </xs:restriction>
      </xs:simpleType>
      <xs:element name="guid" nillable="true" type="tns:guid"/>
      <xs:simpleType name="guid">
        <xs:restriction base="xs:string">
          <xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/>
        </xs:restriction>
      </xs:simpleType>
      <xs:attribute name="FactoryType" type="xs:QName"/>
      <xs:attribute name="Id" type="xs:ID"/>
      <xs:attribute name="Ref" type="xs:IDREF"/>
    </xs:schema>
  </wsdl:types>
  <wsdl:message name="AuthenticationRequest">
    <wsdl:part name="parameters" element="tns:AuthenticationRequest"/>
  </wsdl:message>
  <wsdl:message name="AuthenticationRequest_Headers">
    <wsdl:part name="ApplicationToken" element="tns:ApplicationToken"/>
    <wsdl:part name="ContextIdentifier" element="tns:ContextIdentifier"/>
  </wsdl:message>
  <wsdl:message name="AuthenticationResponse">
    <wsdl:part name="parameters" element="tns:AuthenticationResponse"/>
  </wsdl:message>
  <wsdl:portType name="IPartnerSystemUserService">
    <wsdl:operation name="Authenticate">
      <wsdl:input wsaw:Action="http://www.superoffice.com/superid/partnersystemuser/0.1/IPartnerSystemUserService/Authenticate" name="AuthenticationRequest" message="tns:AuthenticationRequest"/>
      <wsdl:output wsaw:Action="http://www.superoffice.com/superid/partnersystemuser/0.1/IPartnerSystemUserService/AuthenticateResponse" name="AuthenticationResponse" message="tns:AuthenticationResponse"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="BasicHttpBinding_IPartnerSystemUserService" type="tns:IPartnerSystemUserService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="Authenticate">
      <soap:operation soapAction="http://www.superoffice.com/superid/partnersystemuser/0.1/IPartnerSystemUserService/Authenticate" style="document"/>
      <wsdl:input name="AuthenticationRequest">
        <soap:header message="tns:AuthenticationRequest_Headers" part="ApplicationToken" use="literal"/>
        <soap:header message="tns:AuthenticationRequest_Headers" part="ContextIdentifier" use="literal"/>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="AuthenticationResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:binding name="BasicHttpBinding_IPartnerSystemUserService1" type="tns:IPartnerSystemUserService">
    <wsp:PolicyReference URI="#BasicHttpBinding_IPartnerSystemUserService1_policy"/>
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="Authenticate">
      <soap:operation soapAction="http://www.superoffice.com/superid/partnersystemuser/0.1/IPartnerSystemUserService/Authenticate" style="document"/>
      <wsdl:input name="AuthenticationRequest">
        <soap:header message="tns:AuthenticationRequest_Headers" part="ApplicationToken" use="literal"/>
        <soap:header message="tns:AuthenticationRequest_Headers" part="ContextIdentifier" use="literal"/>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="AuthenticationResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="PartnerSystemUserService">
    <wsdl:port name="BasicHttpBinding_IPartnerSystemUserService" binding="tns:BasicHttpBinding_IPartnerSystemUserService">
      <soap:address location="http://localhost/login/Services/PartnerSystemUserService.svc"/>
    </wsdl:port>
    <wsdl:port name="BasicHttpBinding_IPartnerSystemUserService1" binding="tns:BasicHttpBinding_IPartnerSystemUserService1">
      <soap:address location="https://dev-yanjunl.superoffice.no/login/Services/PartnerSystemUserService.svc"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>